export const news = [
    {
        id: 1,
        tag: 'sport',
        img: './public/news1.jpg',
        date: new Date(2020, 10, 4, 11, 58),
        title: 'Требониан Галл происходил из старинного этрусского рода. В конце правления императора ' +
            'Деция Траяна он занимал должность легата',
        description: 'Будущий император Гай Вибий Требониан Галл родился около 206 года. Эта датировка' +
            ' основана на сообщении Псевдо-Аврелия Виктора, который в своей «Эпитоме» пишет, что на момент ' +
            'смерти Гаю было примерно сорок семь лет.',
        likesCount: 11500,
        commentsCount: 1500,
    },
    {
        id: 2,
        tag: 'real estate',
        img: './public/news2.jpg',
        date: new Date(2020, 10, 4, 10, 57),
        title: 'Просто немного другой заголовк статьи',
        description: 'Будущий император Гай Вибий Требониан Галл родился около 206 года. Эта датировка' +
            ' основана на сообщении Псевдо-Аврелия Виктора, который в своей «Эпитоме» пишет, что на момент ' +
            'смерти Гаю было примерно сорок семь лет.',
        likesCount: 2,
        commentsCount: 22,
    },
    {
        id: 3,
        tag: 'finance',
        img: './public/news1.jpg',
        date: new Date(2020, 10, 4, 10, 58),
        title: '2Просто немного другой заголовк статьи2',
        description: 'Будущий император Гай Вибий Требониан Галл родился около 206 года. Эта датировка' +
            ' основана на сообщении Псевдо-Аврелия Виктора, который в своей «Эпитоме» пишет, что на момент ' +
            'смерти Гаю было примерно сорок семь лет.',
        likesCount: 3,
        commentsCount: 33,
    },
    {
        id: 4,
        tag: 'job',
        img: './public/news2.jpg',
        date: new Date(2020, 10, 4, 10, 58),
        title: '3Просто немного другой заголовк статьи3',
        description: 'Будущий император Гай Вибий Требониан Галл родился около 206 года. Эта датировка' +
            ' основана на сообщении Псевдо-Аврелия Виктора, который в своей «Эпитоме» пишет, что на момент ' +
            'смерти Гаю было примерно сорок семь лет.',
        likesCount: 1000000,
        commentsCount: 1000000,
    },
];